Documents/ЗаказНаПродажу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>ЗаказНаПродажу</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорОснование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаСписания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическаяДатаСписания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладСписания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексКартинки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтрокиЗаказа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьЗаЕдиницу</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Деньги</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Деньги</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СтатусыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ожидается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/СторнированиеСтрокиЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>СторнированиеСтрокиЗаказа</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Товары</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаЗакупку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУпаковок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьЗаЕдиницу</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Деньги</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Деньги</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/УпаковкиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>УпаковкиНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ЗаказНаПродажу/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Статус) Тогда
    	ВыполнитьНачальноеЗаполнение();
	КонецЕсли;
	ОбновитьДоступностьЭлементовФормы();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыСтрокиЗаказа

&НаКлиенте
Процедура СтрокиЗаказаПриАктивизацииСтроки(Элемент)
	
	УстановитьДоступностьЭлементовТаблицыСтрокиЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокиЗаказаНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СтрокиЗаказа.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		
		Номенклатура = ТекущиеДанные.Номенклатура;
		
		ТекущиеДанные.ЕдиницаИзмерения = ОбщегоНазначенияСервер.ЗначениеРеквизита(Номенклатура, "БазоваяЕдиницаИзмерения");
		ТекущиеДанные.Упаковка = РаботаСНоменклатурой.УпаковкиНоменклатуры(Номенклатура)[0];
		УстановитьДоступностьЭлементовТаблицыСтрокиЗаказа();	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокиЗаказаКоличествоУпаковокПриИзменении(Элемент)
	
	ВыполнитьПересчет();
	//Тар{
	ТекущиеДанные = Элементы.СтрокиЗаказа.ТекущиеДанные;
	ТекущиеДанные.Сумма = ТекущиеДанные.СтоимостьЗаЕдиницу * ТекущиеДанные.КоличествоУпаковок;
КонецПроцедуры
&НаКлиенте
Процедура СтрокиЗаказаУпаковкаПриИзменении(Элемент)
	ВыполнитьПересчет();
	УстановитьДоступностьЭлементовТаблицыСтрокиЗаказа();//проверка на "без упаковки"	
КонецПроцедуры  

	//}Тар

&НаКлиенте
Процедура СтрокиЗаказаКоличествоПриИзменении(Элемент)
	
	ВыполнитьПересчет();	
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокиЗаказаСуммаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СтрокиЗаказа.ТекущиеДанные;
	ТекущиеДанные.СтоимостьЗаЕдиницу = ТекущиеДанные.Сумма / ТекущиеДанные.КоличествоУпаковок;
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокиЗаказаСтоимостьЗаЕдиницуПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СтрокиЗаказа.ТекущиеДанные;
	ТекущиеДанные.Сумма = ТекущиеДанные.СтоимостьЗаЕдиницу * ТекущиеДанные.КоличествоУпаковок;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьСтатусОжидается(Команда)
	
	НовыйСтатус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказов.Ожидается");
	РаботаСДокументами.УстановитьСтатусДокумента(Объект.Ссылка, НовыйСтатус);	
	ЭтотОбъект.Прочитать();
	ОбновитьОтображениеДанных();
	ОбновитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусЗавершен(Команда)
	
    НовыйСтатус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказов.Завершен");
	РаботаСДокументами.УстановитьСтатусДокумента(Объект.Ссылка, НовыйСтатус);	
	ЭтотОбъект.Прочитать();//Тар
	ОбновитьОтображениеДанных();
	ОбновитьДоступностьЭлементовФормы();//Тар
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусОтменен(Команда)
	
	НовыйСтатус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказов.Отменен");
	РаботаСДокументами.УстановитьСтатусДокумента(Объект.Ссылка, НовыйСтатус);	
	ЭтотОбъект.Прочитать();//Тар
	ОбновитьОтображениеДанных();
	ОбновитьДоступностьЭлементовФормы();//Тар

КонецПроцедуры

&НаКлиенте
Процедура СторнироватьСтроку(Команда)

	ТекущиеДанные = Элементы.СтрокиЗаказа.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = Новый Структура("Номенклатура, Партия, Упаковка, КоличествоУпаковок, ЕдиницаИзмерения, Количество, СтоимостьЗаЕдиницу, Сумма, Заказ",
									ТекущиеДанные.Номенклатура,
									ТекущиеДанные.Партия,
									ТекущиеДанные.Упаковка,
									ТекущиеДанные.КоличествоУпаковок,
									ТекущиеДанные.ЕдиницаИзмерения,
									ТекущиеДанные.Количество,
									ТекущиеДанные.СтоимостьЗаЕдиницу,
									ТекущиеДанные.Сумма,
									Объект.Ссылка);
									
	ПараметрыФормы = Новый Структура("ДанныеСтроки", ДанныеСтроки);
	ОткрытьФорму("Документ.СторнированиеСтрокиЗаказа.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВыполнитьНачальноеЗаполнение()

	Объект.Статус = Перечисления.СтатусыЗаказов.Новый;
	Объект.ИндексКартинки = 0;
	
КонецПроцедуры // ВыполнитьНачальноеЗаполнение()

&НаСервере
Процедура ОбновитьДоступностьЭлементовФормы()
	
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказов.Новый") Тогда 
		
		Элементы.УстановитьСтатусОжидается.Видимость = Истина;
		Элементы.ФормаУстановитьСтатусЗавершен.Видимость = Ложь;
		Элементы.ФормаУстановитьСтатусОтменен.Видимость = Ложь;
		Элементы.СтрокиЗаказаСторнироватьСтроку.Видимость = Ложь;
		Элементы.СтрокиЗаказаУдалитьСтроку.Видимость = Ложь;
		
	ИначеЕсли Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказов.Ожидается") Тогда
		// Недоступен для редактирования
		УправлениеДоступностьюРедактированияРеквизитов.ЗаблокироватьРеквизиты(ЭтаФорма, Объект.Ссылка);
		
		Элементы.УстановитьСтатусОжидается.Видимость = Ложь;
		Элементы.ФормаУстановитьСтатусЗавершен.Видимость = Истина;
		Элементы.ФормаУстановитьСтатусОтменен.Видимость = Истина;
		Элементы.СтрокиЗаказаСторнироватьСтроку.Видимость = Истина;
		Элементы.СтрокиЗаказаУдалитьСтроку.Видимость = Истина;
		
		Элементы.СтрокиЗаказа.ТолькоПросмотр = Истина;
		
	ИначеЕсли Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказов.Завершен") Тогда
		
		Элементы.УстановитьСтатусОжидается.Видимость = Ложь;
		Элементы.ФормаУстановитьСтатусЗавершен.Видимость = Ложь;
		Элементы.ФормаУстановитьСтатусОтменен.Видимость = Ложь;
		Элементы.СтрокиЗаказаСторнироватьСтроку.Видимость = Ложь;
		Элементы.СтрокиЗаказаУдалитьСтроку.Видимость = Ложь;
		
		Элементы.СтрокиЗаказа.ТолькоПросмотр = Истина;
		
	ИначеЕсли Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказов.Отменен") Тогда
		
		Элементы.ФормаУстановитьСтатусЗавершен.Видимость = Ложь;
		Элементы.ФормаУстановитьСтатусОтменен.Видимость = Ложь;
		Элементы.УстановитьСтатусОжидается.Видимость = Ложь;
		Элементы.СтрокиЗаказаСторнироватьСтроку.Видимость = Ложь;
		Элементы.СтрокиЗаказаУдалитьСтроку.Видимость = Ложь;
		
		Элементы.СтрокиЗаказа.ТолькоПросмотр = Истина;
		
	КонецЕсли;

КонецПроцедуры // ОбновитьДоступностьЭлементовФормы()

&НаКлиенте
Процедура ВыполнитьПересчет()

	ТекущиеДанные = Элементы.СтрокиЗаказа.ТекущиеДанные;
	
	Если ТекущиеДанные.Упаковка = ПредопределенноеЗначение("Справочник.УпаковкиНоменклатуры.БезУпаковки") Тогда
		
		ТекущиеДанные.КоличествоУпаковок = ТекущиеДанные.Количество;
		
	Иначе
		
		КратностьУпаковки = ОбщегоНазначенияСервер.ЗначениеРеквизита(ТекущиеДанные.Упаковка, "Кратность");
		ТекущиеДанные.Количество = ТекущиеДанные.КоличествоУпаковок * КратностьУпаковки;	
		
	КонецЕсли;

КонецПроцедуры // ВыполнитьПересчёт()

&НаКлиенте
Процедура УстановитьДоступностьЭлементовТаблицыСтрокиЗаказа()
	
	ТекущиеДанные = Элементы.СтрокиЗаказа.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Упаковка = ПредопределенноеЗначение("Справочник.УпаковкиНоменклатуры.БезУпаковки") Тогда
		Элементы.СтрокиЗаказаКоличествоУпаковок.Доступность = Ложь;
		Элементы.СтрокиЗаказаКоличество.Доступность = Истина;
	Иначе
		Элементы.СтрокиЗаказаКоличество.Доступность = Ложь;
		Элементы.СтрокиЗаказаКоличествоУпаковок.Доступность = Истина;
	КонецЕсли;	

КонецПроцедуры // УстановитьДоступностьЭлементовТаблицыСтрокиЗаказа()



#КонецОбласти
